# while (i:=input('-> ')) != '2':
#     print('NO')
# else:
#     print('Good')


# 1. Напишите программу, которая принимает на вход число N и выдаёт
# последовательность из N членов.
    
#     *Пример:*
#     - Для N = 5: 1, -3, 9, -27, 81
 
n = int(input('Для составления последовательности, введите натуральное число N -->  '))
i = 1
k = 1
while i in range(1,n+1):
    if i==1:
        i+=1
        print(k, end = ' ')
        
    else:
        print(f'{k*(-3)} ', end = ' ')
        i+=1
        k=k*(-3)
        




# 2. Для натурального n создать, состоящий из 
# элементов последовательности 3n + 1.
    
#     *Пример:*
#     - Для n = 6: 
#         1: 4,
#         2: 7, 
#         3: 10, 
#         4: 13, 
#         5: 16, 
#         6: 19

n = int(input("Введите натуральное число N -->  "))
i = 1
for i in range(1,n+1):
    print(f"{i}:  {3*i + 1}")


# 3. Напишите программу, в которой пользователь будет задавать две строки, 
# а программа - определять количество вхождений одной строки в другой.
# "Я люблю питон!"
# "люб" -> 2

string = 'Я люблю питон'
counter = string.count('люб')
print(counter)

# альтернативное решение

str1 = input('Введите строку 1: ')
str2 = input('Введите строку 2: ')

print(len(str1.split(str2)) - 1)
