#1. Напишите программу, которая принимает на вход два числа и проверяет,
#является ли одно число квадратом другого.
    
   # *Примеры:* 
    
    #- 5, 25 -> да
    #- 4, 16 -> да
    #- 25, 5 -> да
    #- 8,9 -> нет
first_num = int(input('Введите первое число:   '))
second_num = int(input('Введите второе число:   '))
if second_num * second_num == first_num:
    print('Первое число является квадратом второго')
elif first_num * first_num == second_num:
    print('Второе число является квадратом первого')
else:
    print('Ни одно число не является квадратом другого')

# 1. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.
    
#     Примеры:
#     - 1, 4, 8, 7, 5 -> 8
#     - 78, 55, 36, 90, 2 -> 90
num = [0, 0, 0, 0, 0]
for i in range(5):
    num[i] = int(input('Введите число --> '))
max = num[0]
for i in range(len(num)-1):
    if num[i+1] > max:
        max = num[i+1]
print(f'Максимальное число {max}')


# 2. Напишите программу, которая будет на вход принимать число N и выводить числа от -N до N
    
#     *Примеры:* 
    
#     - 5 -> -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5

N = int(input('Введите число N --> '))
for i in range(-N, N+1):
    print(i, end = '  ')
    
# 3. Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.
    
#     *Примеры:*
    
#     - 6,78 -> 7
#     - 5 -> нет
#     - 0,34 -> 3


drob = float(input('Введите дробное число  --> '))
print(f'Первая цифра дробной части числа: {int(drob * 10) % 10}')

    
# 4. Напишите программу, которая принимает на вход число и проверяет, кратно ли оно (5 и 10) или (15, но не 30).
number = int(input('Введите число  --> '))
if (number%10 ==0) or (number % 15 == 0):
    print('yes')
else: print('no')
